In [1]:
import sqlalchemy

In [2]:
sqlalchemy.create_engine('mysql://root:admin@localhost:3306/learnsql')

Engine(mysql://root:***@localhost:3306/learnsql)

In [2]:
%load_ext sql

In [3]:
%sql mysql://root:admin@localhost:3306/learnsql

'Connected: root@learnsql'

In [4]:
%%sql 
show tables

 * mysql://root:***@localhost:3306/learnsql
0 rows affected.

[]

In [5]:
%%sql 
create table test
(EMP_ID serial not null primary key,
EMP_NAME varchar(20) );

 * mysql://root:***@localhost:3306/learnsql
0 rows affected.

[]

In [6]:
%%sql 
alter table test add
EMP_ZIP char(6);

 * mysql://root:***@localhost:3306/learnsql
0 rows affected.

[]

In [7]:
%%sql
alter table test modify
EMP_ZIP varchar(6);

 * mysql://root:***@localhost:3306/learnsql
0 rows affected.

[]

In [24]:
%%sql
insert into test (EMP_NAME,EMP_ZIP)
values ('baolong2','l5c3z5');

 * mysql://root:***@localhost:3306/learnsql
1 rows affected.

[]

In [22]:
%%sql
select * from test;

 * mysql://root:***@localhost:3306/learnsql
2 rows affected.

[(1, 'baolong', 'l5c3z5'), (2, 'baolong1', 'l5c3z6')]

In [26]:
%%sql
select EMP_ID, EMP_NAME, EMP_ZIP 
from test
where EMP_ID > 1
group by EMP_NAME
order by EMP_ID
;

 * mysql://root:***@localhost:3306/learnsql
2 rows affected.

[(1, 'baolong', 'l5c3z5'), (3, 'baolong2', 'l5c3z5')]

In [28]:
%%sql
select EMP_ID+5, EMP_NAME, EMP_ZIP 
from test
where EMP_ZIP in ('l5c3z5')
group by EMP_NAME
order by EMP_ID
;

 * mysql://root:***@localhost:3306/learnsql
2 rows affected.

[(6, 'baolong', 'l5c3z5'), (8, 'baolong2', 'l5c3z5')]

In [29]:
%%sql
select EMP_ID+5, EMP_NAME, EMP_ZIP 
from test
where EMP_ZIP in ('l5c3z5') and EMP_ZIP like '%l%'
group by EMP_NAME
order by EMP_ID
;

 * mysql://root:***@localhost:3306/learnsql
2 rows affected.

[(6, 'baolong', 'l5c3z5'), (8, 'baolong2', 'l5c3z5')]

In [31]:
%%sql
select EMP_ID, concat(EMP_NAME,'Wu') Name, EMP_ZIP 
from test
where EMP_ZIP in ('l5c3z5')
group by EMP_NAME
order by EMP_ID
;

 * mysql://root:***@localhost:3306/learnsql
2 rows affected.

[(1, 'baolongWu', 'l5c3z5'), (3, 'baolong2Wu', 'l5c3z5')]

In [32]:
%%sql
select A.EMP_ID, B.EMP_NAME, B.EMP_ZIP 
from test A, test B
where A.EMP_ID= B.EMP_ID
group by EMP_NAME
order by EMP_ID
;

 * mysql://root:***@localhost:3306/learnsql
3 rows affected.

[(1, 'baolong', 'l5c3z5'),
 (2, 'baolong1', 'l5c3z6'),
 (3, 'baolong2', 'l5c3z5')]

In [35]:
%%sql
select A.EMP_ID, B.EMP_NAME, B.EMP_ZIP 
from test A left outer join test B
on A.EMP_ID= B.EMP_ID
group by EMP_NAME
order by EMP_ID
;

 * mysql://root:***@localhost:3306/learnsql
3 rows affected.

[(1, 'baolong', 'l5c3z5'),
 (2, 'baolong1', 'l5c3z6'),
 (3, 'baolong2', 'l5c3z5')]

In [37]:
%%sql
update test
    set EMP_NAME='Baolong Wu'
    Where EMP_ID= 
                (select max(EMP_ID) 
                 from test
                 where EMP_ZIP='l5c3z5');

 * mysql://root:***@localhost:3306/learnsql
(MySQLdb._exceptions.OperationalError) (1093, "You can't specify target table 'test' for update in FROM clause")
[SQL: update test
    set EMP_NAME='Baolong Wu'
    Where EMP_ID=
                (select max(EMP_ID)
                 from test
                 where EMP_ZIP='l5c3z5')
;]
(Background on this error at: http://sqlalche.me/e/e3q8)

In [40]:
%%sql
update test
    set EMP_NAME='Baolong Wu'
    Where EMP_ID= 
                (select max(EMP_ID) 
                 from test
                 where EMP_ZIP='l5c3z5');

 * mysql://root:***@localhost:3306/learnsql
(MySQLdb._exceptions.OperationalError) (1093, "You can't specify target table 'test' for update in FROM clause")
[SQL: update test
    set EMP_NAME='Baolong Wu'
    Where EMP_ID=
                (select max(EMP_ID)
                 from test
                 where EMP_ZIP='l5c3z5');]
(Background on this error at: http://sqlalche.me/e/e3q8)